org/_projects/2020-09-11-alphaconnect.org
#+BEGIN_EXPORT html
---
layout: post
title: "AlphaConnect: Implementing an AlphaZero inspired deep RL system"
location: Franconia, New Hampshire, USA
date: 2020-09-11
math: true
link:
  - https://github.com/ajpkim/alpha_connect4
  - github
---
 #+END_EXPORT

* 1. AlphaGo → AlphaGo Zero → *AlphaZero* → MuZero
   :PROPERTIES:
   :CUSTOM_ID: alphago-alphago-zero-alphazero-muzero
   :END:
In 2015 DeepMind's [[https://storage.googleapis.com/deepmind-media/alphago/AlphaGoNaturePaper.pdf][AlphaGo]] beat one of the most decorated [[https://en.wikipedia.org/wiki/Go_(game)][Go]] players of all time, Lee Sedol, 4-1 in a highly publicized match. The event brought Go within the domain of computer dominated games far earlier than many predicted given the complexity of the game. While the rules of Go are extremely simple, the number of possible board states that follow is over $10^{170}$, an enormous number that illuminates why no computer program had ever beaten a professional Go player prior to AlphaGo. The vast complexity of the game and the futility of traditional search based methods leads many to perceive Go as the pinnacle of human intuition and strategy within the domain of games.

DeepMind overcame the traditional obstacles posed by Go by pairing a deep neural network with a search algorithm that leverages the network's intuitive evaluations of the game state to focus the search on fruitful parts of the immense game tree. This setup, combined with a novel approach to improving the network with training data generated through self-play, allowed AlphaGo to surpass human level performance in the game of Go. Subsequent versions of AlphaGo achieved even greater performance using simpler and more generalizable techniques. The major achievements at each step were the removal of reliance on human game data to bootstrap training ([[https://www.nature.com/articles/nature24270.epdf?author_access_token=VJXbVjaSHxFoctQQ4p2k4tRgN0jAjWel9jnR3ZoTv0PVW4gB86EEpGqTRDtpIz-2rmo8-KG06gqVobU5NSCFeHILHcVFUeMsbvwS-lxjqQGg98faovwjxeTUgZAUMnRQ][AlphaGo Zero]]), the removal of game specific heuristics in training and generalization to Chess and Shogi ([[https://arxiv.org/abs/1712.01815][AlphaZero]]), and the replacement of a given deterministic model by a learned internal model - rules and all - along with further domain generalization ([[https://arxiv.org/abs/1911.08265][MuZero]]).

These innovations all support a learning system that is capable of bootstrapping knowledge from its own experience and achieving mastery across many environments without needing any hard-coded domain knowledge or initial training data. To better understand how these systems work I recently implemented my own AlphaZero inspired deep RL system that learns [[https://en.wikipedia.org/wiki/Connect_Four][connect4]] entirely through self-play and which can be extended to other adversarial games. Here, I'll walk through the key concepts (move selection and MCTS, self-play, training, model architecture) behind AlphaZero with code examples using pytorch. My implementation is a shallower version of the original architecture with some minor differences which I will point out as they come up.

* Table of Contents                                                     :TOC:
- [[1. AlphaGo → AlphaGo Zero → *AlphaZero* → MuZero][1. AlphaGo → AlphaGo Zero → *AlphaZero* → MuZero]]
- [[2. The Intuitive Picture][2. The Intuitive Picture]]
- [[3. Move Selection][3. Move Selection]]
  - [[3.1. MCTS simulation][3.1. MCTS simulation]]
- [[4. Self-Play Policy Improvement][4. Self-Play Policy Improvement]]
  - [[4.1. MCTS self-play][4.1. MCTS self-play]]
  - [[4.2. Loss and learning][4.2. Loss and learning]]
- [[5. The Network][5. The Network]]
  - [[5.1. Game state encoding][5.1. Game state encoding]]
  - [[5.2. Convolutional layer][5.2. Convolutional layer]]
  - [[5.3. Residual blocks][5.3. Residual blocks]]
  - [[5.4. Value head][5.4. Value head]]
  - [[5.5. Policy head][5.5. Policy head]]
  - [[5.6. Putting it all together][5.6. Putting it all together]]
- [[6. AlphaConnect][6. AlphaConnect]]
  - [[6.1. Hyperparameters][6.1. Hyperparameters]]
  - [[6.2. Multithreading][6.2. Multithreading]]
- [[7. Looking Ahead][7. Looking Ahead]]

* 2. The Intuitive Picture
   :PROPERTIES:
   :CUSTOM_ID: the-intuitive-picture
   :END:
Before discussing the details I want to give a little more overview of how AlphaZero works at an intuitive level to help frame what follows. Traditional game engines like [[https://en.wikipedia.org/wiki/Deep_Blue_(chess_computer)][Deep Blue]] or [[https://en.wikipedia.org/wiki/Stockfish_(chess)][StockFish]] rely on deep searches in the game tree and hard-coded game-specific evaluation features to assess and find moves. In contrast to these less general methods, AlphaZero learns entirely from its own experience playing the game, adopting strategies that fare well and moving on from ones that fare poorly.

The system begins with no strategic information about the game and must discover meaningful patterns and strategies by itself. Over the course of training we can watch AlphaZero discover openings and tactics that have been used at different times throughout human history as the system explores the space of possibilities. The learning and creativity in devising new strategies in games as complex as chess and Go is remarkable.

When making a move, AlphaZero begins by querying its deep neural network for an approximate evaluation of the game state and a preliminary probability distribution over the possible actions. The initial move probabilities represent how attractive the network believes each move to be. These prior probabilities and value estimates are used to guide a more reflective search process. The search process explores the game tree, favoring paths that lead to higher state values and storing information about each state and possible action as it explores. The normalized action counts from the search process form an improved policy $\pi$ and are used to select the actual game move. Training aims to bring the network's intuitive value estimations of the game state closer to the actual game outcomes and the prior probabilities closer to the probabilities reflected in the normalized action counts from the search process.

The result is a feedback cycle where the network guides the search process which in turn guides the network. This setup allows the system to generate its own training data through games against itself. The network is always challenged to improve by an equally skilled opponent and is unconstrained by human approaches and domain knowledge. Below I will discuss in more detail the move selection process, network architecture, and self-play training regime.

