_projects/2020-09-11-alphaconnect.html

<div id="outline-container-org852cda8" class="outline-2">
<h2 id="move-selection">3. Move Selection</h2>
<div class="outline-text-2" id="text-move-selection">
<p>
To select moves, AlphaZero uses a
<a href="https://www.youtube.com/watch?v=UXW2yZndl7U">Monte-Carlo tree search
(MCTS)</a> algorithm that is guided by the network's
prior action probabilities \(p\) and estimations of state value \(v\):
</p>

<p>
\[(p,v)= f_{\theta} (s)\]
</p>

<p>
The search tree is used to acquire information about possible trajectories and is maintained throughout the course of the game. Nodes in the game tree correspond to game states and are connected by directed edges which represent actions. The following statistics are maintained for each edge and are used to decide which move to take during the MCTS search process:
</p>

<ul class="org-ul">
<li>\(N(s,a)\): number of times action \(a\) has been taken from state \(s\)</li>
<li>\(W(s,a)\): total value derived after taking action \(a\) in state \(s\)</li>
<li>\(Q(s,a)\): mean value of taking action \(a\) in state \(s\)</li>
<li>\(P(s,a)\): prior probability of selecting action \(a\) in state \(s\)</li>
</ul>

<p>
When prompted for a move, AlphaZero executes 800 MCTS simulations. Each simulation begins with the current game state as the root and traverses the game tree according to a polynomial upper-confidence tree search algorithm (PUCT), a variant of the upper-confidence tree search algorithm (UCT), until a leaf node is encountered (see below). A leaf node represents either a terminal game state or a game state not yet included in the tree.
</p>

<p>
Unlike traditional MCTS methods, AlphaZero does not use random rollouts to evaluate non-terminal leaf nodes. Instead, the network provides an approximate state value for the leaf node along with prior probabilities that the new leaf edges are initialized with. After initializing the new edges, the value of the leaf state (network approximation \(v\) or actual game outcome) is propagated back up to each node along the path taken from the root to leaf. Other statistics are updated during this step as well. Winning paths accrue higher value (larger \(W\) and \(Q\)) and are more likely to be explored in future simulations.
</p>

<p>
Eventually, the normalized action counts (computed using \(N\) values) from the MCTS simulations form an improved policy \({\pi}\). These action counts reflect the perceived value associated with each edge from the current root node. Winning paths should have high visit counts and thus have a greater probability of being selected when sampling from \(\pi\). After executing 800 MCTS simulations and gathering statistics about the value of each move, the actual game move is then sampled from \({\pi}\). In competitive play, as opposed to training, the move with the highest visit count can be chosen deterministically. In my implementation I used 200 MCTS simulations given time and compute costs and the simplicity of connect4 in comparison to Go or chess.
</p>
</div>
