org/_projects/2020-09-11-alphaconnect.org
** 3.1. MCTS simulation
    :PROPERTIES:
    :CUSTOM_ID: mcts-simulation
    :END:
The goal of the MCTS simulations is to improve on the network's preliminary action probabilities and discover paths that lead to higher state values and winning the game. To accomplish this the PUCT algorithm must balance exploring possible moves with exploiting what it already believes are worthwhile paths. At each decision point the algorithm selects the move that maximizes $Q + U$ where $Q$ is the mean value of the next state and $U$ is a function of $P$ and $N$ which controls the exploration vs. exploitation tradeoff. Initially $U$ dominates and forces exploration, but as more simulations are executed $Q$ comes to dominate and states with higher values are selected:

$$
a = \arg\max_a \bigg(Q(s,a) + U(s,a)\bigg)
$$

$$
U(s,a) = C_{puct} \cdot P(s,a) \cdot \frac{\sqrt{\sum_b N(s,b)}}{1 + N(s,a)}
$$

- $\sum_b N(s,b)$ is a sum over all the edges from the current state.
- $C_{puct}$ is a hyperparameter. A higher value encourages exploration. AlphaZero uses a value 1.0.

In python (nodes hold stats N, W, Q about the edge leading from parent to self):

#+begin_src python
  class Node:
      def __init__(self, state: np.array, player_id: int, parent=None):
          self.player_id = player_id # necessary to know player perspective
          self.state = state  # game state
          self.parent = parent
          self.edges = {}  # {k=action: v=child node}
          self.W = 0  # sum of total value derived below node
          self.N = 0  # visit count
          self.P = None  # prior probabilities for action. {k=action: v=prob}

      @property
      def Q(self):
          """Average value derived below node."""
          return self.W / self.N if self.N > 0 else 0

      @property
      def explored(self):
          """Boolean for whether node has been explored. False for all terminal nodes."""
          return True if self.edges else False

      @ property
      def Pi(self):
          """Improved MCTS-based policy derived from normalized action counts."""
          policy_probs = np.zeros(7) # adjust to game.actions if want to use for other board dims or games
          if self.N <= 1:
              return policy_probs
          for action in self.edges:
              policy_probs[action] = (self.edges[action].N / (self.N-1))
          return policy_probs

  def select_leaf(node, game,  C_puct=1.0) -> Node:
      """Find a leaf node by recursively traversing the game tree"""
      if not node.explored:
          return node

      # recursively take actions that maximize Q + U until a leaf node is found.
      highest_score = -float('inf')
      next_action = None
      for action in node.edges:
          Q = node.edges[action].Q
          U = C_puct * node.P[action] * (np.sqrt(node.N) / (1 + node.edges[action].N))
          if Q + U > highest_score:
              highest_score = Q + U
              next_action = action

      game.make_move(next_action)
      next_node = node.edges[next_action]

      return select_leaf(next_node, game)
#+end_src

And here's a high level view of the whole MCTS process (=dirichlet_alpha= is a hyperparameter impacting exploration by adding noise to the prior probabilities):

#+begin_src python
  def mcts_search(root, net, game, n_simulations, C_puct, dirichlet_alpha, training)
      """
      Return game action after executing given number of MCTS simulations
      from root node (current game state).
      """
      for simulation in range(n_simulations):
          game_copy = copy.deepcopy(game)
          leaf = select_leaf(root, game_copy, C_puct)
          process_leaf(leaf, net, game_copy, dirichlet_alpha)
          action = select_action(root, training)

      return action
#+end_src

* 4. Self-Play Policy Improvement
   :PROPERTIES:
   :CUSTOM_ID: self-play-policy-improvement
   :END:
The self-play training regime is what I find to be the most interesting part of AlphaZero. The ability to learn solely from its own experience playing games against itself allows for more general learning that is unconstrained by human knowledge of the domain. AlphaZero requires no human feedback, hard-coded evaluation features, nor initial game data to achieve superhuman ability.

