_projects/2020-09-11-alphaconnect.html

<div id="outline-container-orgd713bab" class="outline-3">
<h3 id="mcts-simulation">3.1. MCTS simulation</h3>
<div class="outline-text-3" id="text-mcts-simulation">
<p>
The goal of the MCTS simulations is to improve on the network's preliminary action probabilities and discover paths that lead to higher state values and winning the game. To accomplish this the PUCT algorithm must balance exploring possible moves with exploiting what it already believes are worthwhile paths. At each decision point the algorithm selects the move that maximizes \(Q + U\) where \(Q\) is the mean value of the next state and \(U\) is a function of \(P\) and \(N\) which controls the exploration vs. exploitation tradeoff. Initially \(U\) dominates and forces exploration, but as more simulations are executed \(Q\) comes to dominate and states with higher values are selected:
</p>

<p>
\[
a = \arg\max_a \bigg(Q(s,a) + U(s,a)\bigg)
\]
</p>

<p>
\[
U(s,a) = C_{puct} \cdot P(s,a) \cdot \frac{\sqrt{\sum_b N(s,b)}}{1 + N(s,a)}
\]
</p>

<ul class="org-ul">
<li>\(\sum_b N(s,b)\) is a sum over all the edges from the current state.</li>
<li>\(C_{puct}\) is a hyperparameter. A higher value encourages exploration. AlphaZero uses a value 1.0.</li>
</ul>

<p>
In python (nodes hold stats N, W, Q about the edge leading from parent to self):
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">Node</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, state: np.array, player_id: <span class="org-builtin">int</span>, parent=<span class="org-constant">None</span>):
        <span class="org-keyword">self</span>.player_id = player_id <span class="org-comment-delimiter"># </span><span class="org-comment">necessary to know player perspective</span>
        <span class="org-keyword">self</span>.state = state  <span class="org-comment-delimiter"># </span><span class="org-comment">game state</span>
        <span class="org-keyword">self</span>.parent = parent
        <span class="org-keyword">self</span>.edges = {}  <span class="org-comment-delimiter"># </span><span class="org-comment">{k=action: v=child node}</span>
        <span class="org-keyword">self</span>.W = 0  <span class="org-comment-delimiter"># </span><span class="org-comment">sum of total value derived below node</span>
        <span class="org-keyword">self</span>.N = 0  <span class="org-comment-delimiter"># </span><span class="org-comment">visit count</span>
        <span class="org-keyword">self</span>.P = <span class="org-constant">None</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">prior probabilities for action. {k=action: v=prob}</span>

    @<span class="org-builtin">property</span>
    <span class="org-keyword">def</span> <span class="org-function-name">Q</span>(<span class="org-keyword">self</span>):
        <span class="org-doc">"""Average value derived below node."""</span>
        <span class="org-keyword">return</span> <span class="org-keyword">self</span>.W / <span class="org-keyword">self</span>.N <span class="org-keyword">if</span> <span class="org-keyword">self</span>.N &gt; 0 <span class="org-keyword">else</span> 0

    @<span class="org-builtin">property</span>
    <span class="org-keyword">def</span> <span class="org-function-name">explored</span>(<span class="org-keyword">self</span>):
        <span class="org-doc">"""Boolean for whether node has been explored. False for all terminal nodes."""</span>
        <span class="org-keyword">return</span> <span class="org-constant">True</span> <span class="org-keyword">if</span> <span class="org-keyword">self</span>.edges <span class="org-keyword">else</span> <span class="org-constant">False</span>

    @ <span class="org-builtin">property</span>
    <span class="org-keyword">def</span> <span class="org-function-name">Pi</span>(<span class="org-keyword">self</span>):
        <span class="org-doc">"""Improved MCTS-based policy derived from normalized action counts."""</span>
        <span class="org-variable-name">policy_probs</span> = np.zeros(7) <span class="org-comment-delimiter"># </span><span class="org-comment">adjust to game.actions if want to use for other board dims or games</span>
        <span class="org-keyword">if</span> <span class="org-keyword">self</span>.N &lt;= 1:
            <span class="org-keyword">return</span> policy_probs
        <span class="org-keyword">for</span> action <span class="org-keyword">in</span> <span class="org-keyword">self</span>.edges:
            <span class="org-variable-name">policy_probs</span>[action] = (<span class="org-keyword">self</span>.edges[action].N / (<span class="org-keyword">self</span>.N-1))
        <span class="org-keyword">return</span> policy_probs

<span class="org-keyword">def</span> <span class="org-function-name">select_leaf</span>(node, game,  C_puct=1.0) -&gt; Node:
    <span class="org-doc">"""Find a leaf node by recursively traversing the game tree"""</span>
    <span class="org-keyword">if</span> <span class="org-keyword">not</span> node.explored:
        <span class="org-keyword">return</span> node

    <span class="org-comment-delimiter"># </span><span class="org-comment">recursively take actions that maximize Q + U until a leaf node is found.</span>
    <span class="org-variable-name">highest_score</span> = -<span class="org-builtin">float</span>(<span class="org-string">'inf'</span>)
    <span class="org-variable-name">next_action</span> = <span class="org-constant">None</span>
    <span class="org-keyword">for</span> action <span class="org-keyword">in</span> node.edges:
        <span class="org-variable-name">Q</span> = node.edges[action].Q
        <span class="org-variable-name">U</span> = C_puct * node.P[action] * (np.sqrt(node.N) / (1 + node.edges[action].N))
        <span class="org-keyword">if</span> Q + U &gt; highest_score:
            <span class="org-variable-name">highest_score</span> = Q + U
            <span class="org-variable-name">next_action</span> = action

    game.make_move(next_action)
    <span class="org-variable-name">next_node</span> = node.edges[next_action]

    <span class="org-keyword">return</span> select_leaf(next_node, game)
</pre>
</div>

<p>
And here's a high level view of the whole MCTS process (<code>dirichlet_alpha</code> is a hyperparameter impacting exploration by adding noise to the prior probabilities):
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">mcts_search</span>(root, net, game, n_simulations, C_puct, dirichlet_alpha, training)
    <span class="org-doc">"""</span>
<span class="org-doc">    Return game action after executing given number of MCTS simulations</span>
<span class="org-doc">    from root node (current game state).</span>
<span class="org-doc">    """</span>
    <span class="org-keyword">for</span> simulation <span class="org-keyword">in</span> <span class="org-builtin">range</span>(n_simulations):
        <span class="org-variable-name">game_copy</span> = copy.deepcopy(game)
        <span class="org-variable-name">leaf</span> = select_leaf(root, game_copy, C_puct)
        process_leaf(leaf, net, game_copy, dirichlet_alpha)
        <span class="org-variable-name">action</span> = select_action(root, training)

    <span class="org-keyword">return</span> action
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc47844e" class="outline-2">
<h2 id="self-play-policy-improvement">4. Self-Play Policy Improvement</h2>
<div class="outline-text-2" id="text-self-play-policy-improvement">
<p>
The self-play training regime is what I find to be the most interesting part of AlphaZero. The ability to learn solely from its own experience playing games against itself allows for more general learning that is unconstrained by human knowledge of the domain. AlphaZero requires no human feedback, hard-coded evaluation features, nor initial game data to achieve superhuman ability.
</p>
</div>
