org/_projects/2020-09-11-alphaconnect.org
** 4.1. MCTS self-play
    :PROPERTIES:
    :CUSTOM_ID: mcts-self-play
    :END:
The network is randomly initialized and entirely trained on data generated through games of self-play using the guided MCTS search process described above to select moves and find a policy $\pi$. For each time-step $t$ of a self-play game, a training example $(s_t, \pi_t, z_t)$ consisting of game state, MCTS policy, and game outcome from the perspective of the player at step $t$ is generated and stored. Game outcomes are necessarily added after the game has been completed. A replay buffer stores all the training data from recent games to help reduce correlations in the training data and support more stable learning.

#+begin_src python
  def mcts_self_play(net, game, n_simulations, C_puct, dirichlet_alpha) -> tuple:
      """
      Generate training data via self-play. Returns tuple of (state, Pi, Z) lists.
      Pi: improved action probabilities resulting from MCTS.
      Z: game outcome with value in [-1, 0, 1] for loss, tie, win.
      """
      states, Pis, Zs = [],[],[]
      current_node = Node(game.state, parent=None, player_id=game.player_turn)

      while not game.outcome:
          action = mcts_search(current_node, net, game,
                               n_simulations, C_puct, dirichlet_alpha, training=True)
          states.append(game.state)
          Pis.append(current_node.Pi)
          Zs.append(0)  #  value for a tie game used as placeholder
          game.make_move(action)
          current_node = current_node.edges[action]

      if game.outcome == 1:  # player 1 won game
          Zs[::2] = [1] * len(Zs[::2])
          Zs[1::2] = [-1] * len(Zs[1::2])
      elif game.outcome == 2:  # player 2 won game
          Zs[::2] = [-1] * len(Zs[::2])
          Zs[1::2] = [1] * len(Zs[1::2])

      return states, Pis, Zs
#+end_src

** 4.2. Loss and learning
    :PROPERTIES:
    :CUSTOM_ID: loss-and-learning
    :END:
After some number of self-play games, a batch of training examples is drawn uniformly from the replay buffer and used to train the network. Recall that the network outputs a tuple of prior probabilities and a game outcome prediction given a state, $(p, v) = f_\theta (s)$. The relevant quantities for training are:

- $z$: Game outcome (+1: win, -1: loss, 0: tie)
- $v$: Network's predicted game outcome
- $\pi$: Improved MCTS-based policy
- $p$: Network's initial policy

The network parameters $\theta$ are trained to minimize the error between the actual game outcome and the predicted outcome and to maximize the similarity between the improved MCTS-based policy and the network's intuitive policy. The loss function used to accomplish this is a combination of mean squared error for the value estimates and cross-entropy for the policy with a hyperparameter $c$ controlling L2 weight regularization:

$$
Loss = (z-v)^2 - {\pi} \log{p} + c \vert\vert\theta\vert\vert^2
$$

The improved network parameters $\theta$ are then used in generating the next iteration of self-play data which allow the network to better guide the MCTS which in turn leads to better training data.

In python (with regularization outsourced to the torch optimizer):

#+begin_src python
  class AlphaLoss(torch.nn.Module):
      def __init__(self):
          super(AlphaLoss, self).__init__()

      def forward(self, z, pi, v, p):
          value_loss = ((z - v) ** 2).mean()
          policy_loss = torch.sum(-pi * p.log(), axis=1).mean()
          return value_loss + policy_loss

  def learn():
      """
      Perform one learning step with batch uniformly sampled from replay
      buffer which stores data as named tuples.
      """
      batch = replay_buffer.sample(batch_size)
      states = torch.stack([x.state for x in batch]).to(device)
      pi = torch.tensor([x.pi for x in batch], dtype=torch.float32).to(device)
      z = torch.tensor([x.z for x in batch], dtype=torch.float32).to(device)

      optimizer.zero_grad()
      v, p = net(states)
      loss = loss_fn(z, pi, v, p)
      loss.backward()
      optimizer.step()
#+end_src

* 5. The Network
   :PROPERTIES:
   :CUSTOM_ID: the-network
   :END:
With everything else now in place let's turn to the actual network architecture. AlphaZero is a deep residual neural network with value and policy heads. The network takes in the raw game state and outputs a tuple consisting of a preliminary policy vector of probabilities over the action space and a value estimate of the expected outcome (win, lose, draw). There are 4 main components to the AlphaZero architecture: 1. convolutional layer 2. residual blocks 3. value head 4. policy head

** 5.1. Game state encoding
    :PROPERTIES:
    :CUSTOM_ID: game-state-encoding
    :END:
Go is played on a 19x19 board and AlphaZero is provided the game state as a (19x19x17) tensor in the case of Go (different games require different dimensions). The 17 channels encode the position of each players pieces in the current and previous 7 positions as well as whose turn it is. The rules of Go demand that historical board information is included in the input as the current board state alone isn't sufficient to describe the global game state. In my implementation I encoded the game state as a (6x7x3) tensor given that connect4 is played on a 6x7 grid and historical information doesn't impact the game state. Two separate channels represent each player's pieces (0 indicating empty, and 1 indicating a piece at the position), and the last channel is used to indicate whose turn it is.

