_projects/2020-09-11-alphaconnect.html

<div id="outline-container-org0999c02" class="outline-3">
<h3 id="mcts-self-play">4.1. MCTS self-play</h3>
<div class="outline-text-3" id="text-mcts-self-play">
<p>
The network is randomly initialized and entirely trained on data generated through games of self-play using the guided MCTS search process described above to select moves and find a policy \(\pi\). For each time-step \(t\) of a self-play game, a training example \((s_t, \pi_t, z_t)\) consisting of game state, MCTS policy, and game outcome from the perspective of the player at step \(t\) is generated and stored. Game outcomes are necessarily added after the game has been completed. A replay buffer stores all the training data from recent games to help reduce correlations in the training data and support more stable learning.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">mcts_self_play</span>(net, game, n_simulations, C_puct, dirichlet_alpha) -&gt; <span class="org-builtin">tuple</span>:
    <span class="org-doc">"""</span>
<span class="org-doc">    Generate training data via self-play. Returns tuple of (state, Pi, Z) lists.</span>
<span class="org-doc">    Pi: improved action probabilities resulting from MCTS.</span>
<span class="org-doc">    Z: game outcome with value in [-1, 0, 1] for loss, tie, win.</span>
<span class="org-doc">    """</span>
    <span class="org-variable-name">states</span>, <span class="org-variable-name">Pis</span>, <span class="org-variable-name">Zs</span> = [],[],[]
    <span class="org-variable-name">current_node</span> = Node(game.state, parent=<span class="org-constant">None</span>, player_id=game.player_turn)

    <span class="org-keyword">while</span> <span class="org-keyword">not</span> game.outcome:
        <span class="org-variable-name">action</span> = mcts_search(current_node, net, game,
                             n_simulations, C_puct, dirichlet_alpha, training=<span class="org-constant">True</span>)
        states.append(game.state)
        Pis.append(current_node.Pi)
        Zs.append(0)  <span class="org-comment-delimiter">#  </span><span class="org-comment">value for a tie game used as placeholder</span>
        game.make_move(action)
        <span class="org-variable-name">current_node</span> = current_node.edges[action]

    <span class="org-keyword">if</span> game.outcome == 1:  <span class="org-comment-delimiter"># </span><span class="org-comment">player 1 won game</span>
        <span class="org-variable-name">Zs</span>[::2] = [1] * <span class="org-builtin">len</span>(Zs[::2])
        <span class="org-variable-name">Zs</span>[1::2] = [-1] * <span class="org-builtin">len</span>(Zs[1::2])
    <span class="org-keyword">elif</span> game.outcome == 2:  <span class="org-comment-delimiter"># </span><span class="org-comment">player 2 won game</span>
        <span class="org-variable-name">Zs</span>[::2] = [-1] * <span class="org-builtin">len</span>(Zs[::2])
        <span class="org-variable-name">Zs</span>[1::2] = [1] * <span class="org-builtin">len</span>(Zs[1::2])

    <span class="org-keyword">return</span> states, Pis, Zs
</pre>
</div>
</div>
</div>

<div id="outline-container-org226c6d3" class="outline-3">
<h3 id="loss-and-learning">4.2. Loss and learning</h3>
<div class="outline-text-3" id="text-loss-and-learning">
<p>
After some number of self-play games, a batch of training examples is drawn uniformly from the replay buffer and used to train the network. Recall that the network outputs a tuple of prior probabilities and a game outcome prediction given a state, \((p, v) = f_\theta (s)\). The relevant quantities for training are:
</p>

<ul class="org-ul">
<li>\(z\): Game outcome (+1: win, -1: loss, 0: tie)</li>
<li>\(v\): Network's predicted game outcome</li>
<li>\(\pi\): Improved MCTS-based policy</li>
<li>\(p\): Network's initial policy</li>
</ul>

<p>
The network parameters \(\theta\) are trained to minimize the error between the actual game outcome and the predicted outcome and to maximize the similarity between the improved MCTS-based policy and the network's intuitive policy. The loss function used to accomplish this is a combination of mean squared error for the value estimates and cross-entropy for the policy with a hyperparameter \(c\) controlling L2 weight regularization:
</p>

<p>
\[
Loss = (z-v)^2 - {\pi} \log{p} + c \vert\vert\theta\vert\vert^2
\]
</p>

<p>
The improved network parameters \(\theta\) are then used in generating the next iteration of self-play data which allow the network to better guide the MCTS which in turn leads to better training data.
</p>

<p>
In python (with regularization outsourced to the torch optimizer):
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">AlphaLoss</span>(torch.nn.Module):
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>):
        <span class="org-builtin">super</span>(AlphaLoss, <span class="org-keyword">self</span>).__init__()

    <span class="org-keyword">def</span> <span class="org-function-name">forward</span>(<span class="org-keyword">self</span>, z, pi, v, p):
        <span class="org-variable-name">value_loss</span> = ((z - v) ** 2).mean()
        <span class="org-variable-name">policy_loss</span> = torch.<span class="org-builtin">sum</span>(-pi * p.log(), axis=1).mean()
        <span class="org-keyword">return</span> value_loss + policy_loss

<span class="org-keyword">def</span> <span class="org-function-name">learn</span>():
    <span class="org-doc">"""</span>
<span class="org-doc">    Perform one learning step with batch uniformly sampled from replay</span>
<span class="org-doc">    buffer which stores data as named tuples.</span>
<span class="org-doc">    """</span>
    <span class="org-variable-name">batch</span> = replay_buffer.sample(batch_size)
    <span class="org-variable-name">states</span> = torch.stack([x.state <span class="org-keyword">for</span> x <span class="org-keyword">in</span> batch]).to(device)
    <span class="org-variable-name">pi</span> = torch.tensor([x.pi <span class="org-keyword">for</span> x <span class="org-keyword">in</span> batch], dtype=torch.float32).to(device)
    <span class="org-variable-name">z</span> = torch.tensor([x.z <span class="org-keyword">for</span> x <span class="org-keyword">in</span> batch], dtype=torch.float32).to(device)

    optimizer.zero_grad()
    <span class="org-variable-name">v</span>, <span class="org-variable-name">p</span> = net(states)
    <span class="org-variable-name">loss</span> = loss_fn(z, pi, v, p)
    loss.backward()
    optimizer.step()
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgff0e1ac" class="outline-2">
<h2 id="the-network">5. The Network</h2>
<div class="outline-text-2" id="text-the-network">
<p>
With everything else now in place let's turn to the actual network architecture. AlphaZero is a deep residual neural network with value and policy heads. The network takes in the raw game state and outputs a tuple consisting of a preliminary policy vector of probabilities over the action space and a value estimate of the expected outcome (win, lose, draw). There are 4 main components to the AlphaZero architecture: 1. convolutional layer 2. residual blocks 3. value head 4. policy head
</p>
</div>

<div id="outline-container-orge9ac940" class="outline-3">
<h3 id="game-state-encoding">5.1. Game state encoding</h3>
<div class="outline-text-3" id="text-game-state-encoding">
<p>
Go is played on a 19x19 board and AlphaZero is provided the game state as a (19x19x17) tensor in the case of Go (different games require different dimensions). The 17 channels encode the position of each players pieces in the current and previous 7 positions as well as whose turn it is. The rules of Go demand that historical board information is included in the input as the current board state alone isn't sufficient to describe the global game state. In my implementation I encoded the game state as a (6x7x3) tensor given that connect4 is played on a 6x7 grid and historical information doesn't impact the game state. Two separate channels represent each player's pieces (0 indicating empty, and 1 indicating a piece at the position), and the last channel is used to indicate whose turn it is.
</p>
</div>
</div>
