org/_projects/2020-09-11-alphaconnect.org
** 5.2. Convolutional layer
    :PROPERTIES:
    :CUSTOM_ID: convolutional-layer
    :END:
The pairing of a deep convolutional neural network and reinforcement learning in [[https://arxiv.org/pdf/1312.5602v1.pdf][solving Atari games]] using raw pixel data was an earlier breakthrough from DeepMind. AlphaZero similarly leverages convolutional layers throughout the network to help extract useful features from the raw game state. The initial component of the network is a sole convolutional block.

Here is the structure of AlphaZero's initial convolutional layer:
- Raw game state → 256 convolutional filters (3x3) → batch norm → ReLU

Implementation in pytorch (with less convolutional filters):

#+begin_src python
  import torch
  import torch.nn as nn
  import torch.nn.functional as F

  class ConvBlock(nn.Module):
      def __init__(self):
          super(ConvBlock, self).__init__()
          self.conv1 = nn.Conv2d(in_channels=3, out_channels=126,
                                 kernel_size=3, stride=1, padding=1)
          self.bn1 = nn.BatchNorm2d(num_features=126)

      def forward(self, x):
          x = x.view(-1, 3, 6, 7)
          x = F.relu(self.bn1(self.conv1(x)))
          return x
#+end_src

** 5.3. Residual blocks
    :PROPERTIES:
    :CUSTOM_ID: residual-blocks
    :END:
The majority of the network consists of residual blocks. These blocks employ skip connections which feed the outputs of each layer directly into the next layer as well as into layers that are deeper in the network. Skip connections protect against degradation that can occur as networks get deeper and are used throughout the AlphaZero architecture.

Here is the structure for each of AlphaZero's 40 residual blocks:
- input → 256 convolutional filters (3x3) → batch norm → ReLU → 256 convolutional filters (3x3) → batch norm → skip connection → ReLU

Implementation in pytorch (again with less convolutional filters):

#+begin_src python
  class ResidualBlock(nn.Module):
      def __init__(self):
          super(ResidualBlock, self).__init__()
          self.conv1 = nn.Conv2d(in_channels=126, out_channels=126, kernel_size=3,
                                 stride=1, padding=1, bias=False)
          self.bn1 = nn.BatchNorm2d(num_features=126)
          self.conv2 = nn.Conv2d(in_channels=126, out_channels=126, kernel_size=3,
                                 stride=1, padding=1, bias=False)
          self.bn2 = nn.BatchNorm2d(num_features=126)

      def forward(self, x):
          residual = x
          x = F.relu(self.bn1(self.conv1(x)))
          x = self.bn2(self.conv2(x))
          x += residual
          x = F.relu(x)
          return x
#+end_src

** 5.4. Value head
    :PROPERTIES:
    :CUSTOM_ID: value-head
    :END:
After the residual blocks, the network splits into two final processing blocks which output the value estimate and action probabilities. In AlphaGo and AlphaGo Zero, the value head estimated and optimized the probability of winning from a given game state. To handle games with draws such as chess and shogi, AlphaZero's value head instead predicts the expected game outcome (win, lose, draw). The value estimate is used in the search process as an approximate value for the state, helping to guide the search to higher value states.

Here is the structure of AlphaZero's value head:
- input → 1 convolutional filter (1x1) → batch norm → ReLU → fully connected layer → ReLU → fully connected layer → tanh output activation

Implementation in pytorch (different dimensions):

#+begin_src python
  class ValueHead(nn.Module):
      def __init__(self):
          super(ValueHead, self).__init__()
          self.conv1 = nn.Conv2d(in_channels=126, out_channels=1, kernel_size=1,
                                 stride=1, padding=0, bias=False)
          self.bn1 = nn.BatchNorm2d(num_features=1)
          self.fc1 = nn.Linear(in_features=1*6*7, out_features=3*6*7, bias=True)
          self.fc2 = nn.Linear(in_features=3*6*7, out_features=1, bias=True)

      def forward(self, x):
          v = F.relu(self.bn1(self.conv1(x)))
          v = v.view(-1, 6*7)
          v = F.relu(self.fc1(v))
          v = self.fc2(v)
          v = torch.tanh(v)
          return v
#+end_src

** 5.5. Policy head
    :PROPERTIES:
    :CUSTOM_ID: policy-head
    :END:
The policy head outputs action probabilities for each action given a game state. These action probabilities help guide the MCTS search. The search process improves on the initial prior probabilities received from the network.

Here is the structure of AlphaZero's policy head:
- input → 2 convolutional filters (2x2) → batch norm → ReLU → fully connected layer → output probabilities for each move

Implementation in pytorch (different dimensions):

#+begin_src python
  class PolicyHead(nn.Module):
      def __init__(self):
          super(PolicyHead, self).__init__()
          self.conv1 = nn.Conv2d(in_channels=126, out_channels=2, kernel_size=1,
                                 stride=1, padding=0, bias=False)
          self.bn1 = nn.BatchNorm2d(num_features=2)
          self.fc1 = nn.Linear(in_features=2*6*7, out_features=7)

      def forward(self, x):
          p = F.relu(self.bn1(self.conv1(x)))
          p = p.view(-1, 2*6*7)
          p = F.log_softmax(self.fc1(p), dim=1).exp()
          return p
#+end_src

