_projects/2020-09-11-alphaconnect.html

<div id="outline-container-org2db01b0" class="outline-3">
<h3 id="convolutional-layer">5.2. Convolutional layer</h3>
<div class="outline-text-3" id="text-convolutional-layer">
<p>
The pairing of a deep convolutional neural network and reinforcement learning in <a href="https://arxiv.org/pdf/1312.5602v1.pdf">solving Atari games</a> using raw pixel data was an earlier breakthrough from DeepMind. AlphaZero similarly leverages convolutional layers throughout the network to help extract useful features from the raw game state. The initial component of the network is a sole convolutional block.
</p>

<p>
Here is the structure of AlphaZero's initial convolutional layer:
</p>
<ul class="org-ul">
<li>Raw game state → 256 convolutional filters (3x3) → batch norm → ReLU</li>
</ul>

<p>
Implementation in pytorch (with less convolutional filters):
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> torch
<span class="org-keyword">import</span> torch.nn <span class="org-keyword">as</span> nn
<span class="org-keyword">import</span> torch.nn.functional <span class="org-keyword">as</span> F

<span class="org-keyword">class</span> <span class="org-type">ConvBlock</span>(nn.Module):
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>):
        <span class="org-builtin">super</span>(ConvBlock, <span class="org-keyword">self</span>).__init__()
        <span class="org-keyword">self</span>.conv1 = nn.Conv2d(in_channels=3, out_channels=126,
                               kernel_size=3, stride=1, padding=1)
        <span class="org-keyword">self</span>.bn1 = nn.BatchNorm2d(num_features=126)

    <span class="org-keyword">def</span> <span class="org-function-name">forward</span>(<span class="org-keyword">self</span>, x):
        <span class="org-variable-name">x</span> = x.view(-1, 3, 6, 7)
        <span class="org-variable-name">x</span> = F.relu(<span class="org-keyword">self</span>.bn1(<span class="org-keyword">self</span>.conv1(x)))
        <span class="org-keyword">return</span> x
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeb49f61" class="outline-3">
<h3 id="residual-blocks">5.3. Residual blocks</h3>
<div class="outline-text-3" id="text-residual-blocks">
<p>
The majority of the network consists of residual blocks. These blocks employ skip connections which feed the outputs of each layer directly into the next layer as well as into layers that are deeper in the network. Skip connections protect against degradation that can occur as networks get deeper and are used throughout the AlphaZero architecture.
</p>

<p>
Here is the structure for each of AlphaZero's 40 residual blocks:
</p>
<ul class="org-ul">
<li>input → 256 convolutional filters (3x3) → batch norm → ReLU → 256 convolutional filters (3x3) → batch norm → skip connection → ReLU</li>
</ul>

<p>
Implementation in pytorch (again with less convolutional filters):
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">ResidualBlock</span>(nn.Module):
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>):
        <span class="org-builtin">super</span>(ResidualBlock, <span class="org-keyword">self</span>).__init__()
        <span class="org-keyword">self</span>.conv1 = nn.Conv2d(in_channels=126, out_channels=126, kernel_size=3,
                               stride=1, padding=1, bias=<span class="org-constant">False</span>)
        <span class="org-keyword">self</span>.bn1 = nn.BatchNorm2d(num_features=126)
        <span class="org-keyword">self</span>.conv2 = nn.Conv2d(in_channels=126, out_channels=126, kernel_size=3,
                               stride=1, padding=1, bias=<span class="org-constant">False</span>)
        <span class="org-keyword">self</span>.bn2 = nn.BatchNorm2d(num_features=126)

    <span class="org-keyword">def</span> <span class="org-function-name">forward</span>(<span class="org-keyword">self</span>, x):
        <span class="org-variable-name">residual</span> = x
        <span class="org-variable-name">x</span> = F.relu(<span class="org-keyword">self</span>.bn1(<span class="org-keyword">self</span>.conv1(x)))
        <span class="org-variable-name">x</span> = <span class="org-keyword">self</span>.bn2(<span class="org-keyword">self</span>.conv2(x))
        <span class="org-variable-name">x</span> += residual
        <span class="org-variable-name">x</span> = F.relu(x)
        <span class="org-keyword">return</span> x
</pre>
</div>
</div>
</div>

<div id="outline-container-orgae4a347" class="outline-3">
<h3 id="value-head">5.4. Value head</h3>
<div class="outline-text-3" id="text-value-head">
<p>
After the residual blocks, the network splits into two final processing blocks which output the value estimate and action probabilities. In AlphaGo and AlphaGo Zero, the value head estimated and optimized the probability of winning from a given game state. To handle games with draws such as chess and shogi, AlphaZero's value head instead predicts the expected game outcome (win, lose, draw). The value estimate is used in the search process as an approximate value for the state, helping to guide the search to higher value states.
</p>

<p>
Here is the structure of AlphaZero's value head:
</p>
<ul class="org-ul">
<li>input → 1 convolutional filter (1x1) → batch norm → ReLU → fully connected layer → ReLU → fully connected layer → tanh output activation</li>
</ul>

<p>
Implementation in pytorch (different dimensions):
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">ValueHead</span>(nn.Module):
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>):
        <span class="org-builtin">super</span>(ValueHead, <span class="org-keyword">self</span>).__init__()
        <span class="org-keyword">self</span>.conv1 = nn.Conv2d(in_channels=126, out_channels=1, kernel_size=1,
                               stride=1, padding=0, bias=<span class="org-constant">False</span>)
        <span class="org-keyword">self</span>.bn1 = nn.BatchNorm2d(num_features=1)
        <span class="org-keyword">self</span>.fc1 = nn.Linear(in_features=1*6*7, out_features=3*6*7, bias=<span class="org-constant">True</span>)
        <span class="org-keyword">self</span>.fc2 = nn.Linear(in_features=3*6*7, out_features=1, bias=<span class="org-constant">True</span>)

    <span class="org-keyword">def</span> <span class="org-function-name">forward</span>(<span class="org-keyword">self</span>, x):
        <span class="org-variable-name">v</span> = F.relu(<span class="org-keyword">self</span>.bn1(<span class="org-keyword">self</span>.conv1(x)))
        <span class="org-variable-name">v</span> = v.view(-1, 6*7)
        <span class="org-variable-name">v</span> = F.relu(<span class="org-keyword">self</span>.fc1(v))
        <span class="org-variable-name">v</span> = <span class="org-keyword">self</span>.fc2(v)
        <span class="org-variable-name">v</span> = torch.tanh(v)
        <span class="org-keyword">return</span> v
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbe73983" class="outline-3">
<h3 id="policy-head">5.5. Policy head</h3>
<div class="outline-text-3" id="text-policy-head">
<p>
The policy head outputs action probabilities for each action given a game state. These action probabilities help guide the MCTS search. The search process improves on the initial prior probabilities received from the network.
</p>

<p>
Here is the structure of AlphaZero's policy head:
</p>
<ul class="org-ul">
<li>input → 2 convolutional filters (2x2) → batch norm → ReLU → fully connected layer → output probabilities for each move</li>
</ul>

<p>
Implementation in pytorch (different dimensions):
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">PolicyHead</span>(nn.Module):
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>):
        <span class="org-builtin">super</span>(PolicyHead, <span class="org-keyword">self</span>).__init__()
        <span class="org-keyword">self</span>.conv1 = nn.Conv2d(in_channels=126, out_channels=2, kernel_size=1,
                               stride=1, padding=0, bias=<span class="org-constant">False</span>)
        <span class="org-keyword">self</span>.bn1 = nn.BatchNorm2d(num_features=2)
        <span class="org-keyword">self</span>.fc1 = nn.Linear(in_features=2*6*7, out_features=7)

    <span class="org-keyword">def</span> <span class="org-function-name">forward</span>(<span class="org-keyword">self</span>, x):
        <span class="org-variable-name">p</span> = F.relu(<span class="org-keyword">self</span>.bn1(<span class="org-keyword">self</span>.conv1(x)))
        <span class="org-variable-name">p</span> = p.view(-1, 2*6*7)
        <span class="org-variable-name">p</span> = F.log_softmax(<span class="org-keyword">self</span>.fc1(p), dim=1).exp()
        <span class="org-keyword">return</span> p
</pre>
</div>
</div>
</div>
