_projects/2020-09-11-alphaconnect.html

<div id="outline-container-orgbb899cd" class="outline-3">
<h3 id="putting-it-all-together">5.6. Putting it all together</h3>
<div class="outline-text-3" id="text-putting-it-all-together">
<p>
Implementation in pytorch (different number of residual blocks):
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">AlphaNet</span>(nn.Module):
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>):
        <span class="org-builtin">super</span>(AlphaNet, <span class="org-keyword">self</span>).__init__()
        <span class="org-keyword">self</span>.conv = ConvBlock()
        <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(10):
            <span class="org-builtin">setattr</span>(<span class="org-keyword">self</span>, f<span class="org-string">'res{i}'</span>, ResidualBlock())
        <span class="org-keyword">self</span>.value_head = ValueHead()
        <span class="org-keyword">self</span>.policy_head = PolicyHead()

    <span class="org-keyword">def</span> <span class="org-function-name">forward</span>(<span class="org-keyword">self</span>, x):
        <span class="org-variable-name">x</span> = <span class="org-keyword">self</span>.conv(x)
        <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(10):
            <span class="org-variable-name">x</span> = <span class="org-builtin">getattr</span>(<span class="org-keyword">self</span>, f<span class="org-string">'res{i}'</span>)(x)
        <span class="org-variable-name">v</span> = <span class="org-keyword">self</span>.value_head(x)
        <span class="org-variable-name">p</span> = <span class="org-keyword">self</span>.policy_head(x)
        <span class="org-keyword">return</span> v, p
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf8565a3" class="outline-2">
<h2 id="alphaconnect">6. AlphaConnect</h2>
<div class="outline-text-2" id="text-alphaconnect">
<p>
We've covered all the basics of AlphaZero, and I will now discuss the process of implementing my own version, AlphaConnect, to play connect4. Connect4 is a solved game and the first player is capable of a guaranteed win if they play correctly. Although AlphaConnect did not reach this optimal level of performance, over the course of 12k self-play games and learning steps AlphaConnect did reach a strong level of performance. I trained the network on google colab GPUs over the course of a couple weeks. Each colab instance consisted of 600 self-play games and learning steps, and ended with an evaluation phase comparing the latest version and the version from 600 steps ago. Each session of 600 self-play games and 200 evaluation games took about 8 hours, summing to slightly above 130 hours in total. The system does not utilize GPU capacity effectively.
</p>
</div>

<div id="outline-container-orge4eef2c" class="outline-3">
<h3 id="hyperparameters">6.1. Hyperparameters</h3>
<div class="outline-text-3" id="text-hyperparameters">
<p>
The time and compute costs of searching for the best hyperparameters led me to use similar hyperparameters as AlphaZero with adjustments based on the scaled down nature of my project. I followed the AlphaZero learning rate schedule with step durations adjusted to match my hastened learning process. The learning rate started at 0.2 and was multiplied by 0.1 every 3,000 learning steps, ending at 0.0002.
</p>

<p>
A hyperparameter I had to pick intuitively was the size of the replay buffer. AlphaGo Zero made use of a replay buffer that stored training examples from the previous 500,000 games. I opted for a two step approach to handling replay buffer size. The system begins with a small buffer that only holds 6,000 examples, roughly 300 games of data. After the initial 1,600 learning steps the buffer size is doubled to 12,000 examples, roughly 600 games of data. This setup allows the network to cycle through the early less informed training examples quickly and then take advantage of a larger buffer afterwards. Several dips in the learning process lead me to believe that a larger replay buffer would have helped stabilize learning, as the network may have been overfitting to recent game data during these dips, and thus losing ground to more general earlier versions.
</p>

<p>
Given the limited training time and replay buffer size I choose to take advantage of the horizontal symmetry of connect4 and diversify the training data by randomly flipping training examples. Similar techniques were employed in AlphaZero's predecessors but notably removed in AlphaZero to make it a more general system. Board flipping is a way to get better learning results with limited resources and can be easily removed to extend AlphaConnect to different games.
</p>

<p>
Here's the yaml configuration file used to train the network:
</p>

<div class="org-src-container">
<pre class="src src-YAML">### Global params
game: Connect4
random_seed: 9
steps: 600
checkpoint_freq: 200

### MCTS params
n_simulations: 200
C_puct: 2.0
dirichlet_alpha: 0.75

### Eval params
eval: True
eval_sims: 100
eval_episodes: 100

### Training params
batch_size: 512
start_memory_capacity: 6000
end_memory_capacity: 12000
memory_step: 1600
lr: .2
lr_gamma: 0.1
lr_step_size: 3000
lr_scheduler_last_step: 11999
momentum: 0.9
weight_decay: 0.0001
horizontal_flip: True
</pre>
</div>
</div>
</div>

<div id="outline-container-org96dae57" class="outline-3">
<h3 id="multithreading">6.2. Multithreading</h3>
<div class="outline-text-3" id="text-multithreading">
<p>
The biggest weakness of AlphaConnect is that the system is single threaded and cannot make efficient use of gpu resources as a result. In contrast, AlphaZero uses a parallel MCTS algorithm in which multiple threads execute MCTS simulations at the same time. Parallelization means requests to the network can be batched together, games are completed faster, and computational resources are optimized. My single threaded version is simpler and less efficient. If I needed to scale AlphaConnect and train for much longer then it would be necessary to implement multithreading. Multithreading MCTS requires some care and uses virtual losses, temporary losses assigned to edges being explored by a thread, to circumvent the deterministic nature of the MCTS algorithm and allow the threads to effectively explore the game tree. More details can be found <a href="https://dke.maastrichtuniversity.nl/m.winands/documents/multithreadedMCTS2.pdf">here</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-org62b9447" class="outline-2">
<h2 id="looking-ahead">7. Looking Ahead</h2>
<div class="outline-text-2" id="text-looking-ahead">
<p>
Working on this project was a fun way to learn more about how these game playing deep reinforcement learning systems work. Games like Go, chess, and connect4 are well-defined and the systems I discussed (AlphaZero, AlphaConnect) are given perfect models of their world via the rules of the game. These domains are a far cry from the complexity of the outside world and from situations in which an agent must also learn the dynamics of their environment in addition to a good policy (as MuZero does). Still, games can be difficult, and mastering them requires some powerful forms of intelligence. Learning solely from experience in these game environments is an important step in being able to learn in more complex environments and solve less well-defined tasks.
</p>

<p>
Reinforcement learning as a general paradigm for artificial intelligence makes interesting contact with areas in cognitive science that have interested me for a long time. The focus on learning from experience and interacting in a world intuitively aligns RL with perspectives on intelligence that emphasize the role of adaptive learning in the emergence of intelligence. I think RL offers cool ways to study the principles governing the emergence of things like cooperation and intuitive physics. Doing so requires training agents in more complex environments that offer greater feedback and affordances.
</p>

<p>
Next, I'm looking forward to messing around with generative models for reinforcement learning or revisiting an old project - <a href="https://www.red3d.com/cwr/boids/">Boids</a> - and trying to achieve swarm like behavior with RL agents navigating predator/prey dynamics!
</p>
</div>
</div>
